
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>特征工程 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Quantitative_Strategy.html" />
    
    
    <link rel="prev" href="Factors_Construction.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    主页
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Data_Introduction.html">
            
                <a href="Data_Introduction.html">
            
                    
                    行情数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="Stock_Market_Data.html">
            
                <a href="Stock_Market_Data.html">
            
                    
                    股票行情数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="Industry_Data.html">
            
                <a href="Industry_Data.html">
            
                    
                    行业数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="Convertible_Bond_Market_Data.html">
            
                <a href="Convertible_Bond_Market_Data.html">
            
                    
                    可转债行情数据
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="Factors_Construction.html">
            
                <a href="Factors_Construction.html">
            
                    
                    因子构建
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="Feature_Engineering.html">
            
                <a href="Feature_Engineering.html">
            
                    
                    特征工程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Quantitative_Strategy.html">
            
                <a href="Quantitative_Strategy.html">
            
                    
                    量化策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Retest_System.html">
            
                <a href="Retest_System.html">
            
                    
                    回测系统
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >特征工程</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7279;&#x5F81;&#x5DE5;&#x7A0B;">&#x7279;&#x5F81;&#x5DE5;&#x7A0B;</h1>
<h2 id="1-&#x7279;&#x5F81;&#x6E05;&#x6D17;">1. &#x7279;&#x5F81;&#x6E05;&#x6D17;</h2>
<p>&#x7279;&#x5F81;&#x6E05;&#x6D17;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x6570;&#x636E;&#x8FDB;&#x5165;&#x7279;&#x5F81;&#x5DE5;&#x7A0B;&#x7684;&#x540E;&#x7EED;&#x6B65;&#x9AA4;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x6570;&#x636E;&#x5E72;&#x51C0;&#xFF0C;&#x4E0D;&#x5E26;&#x6709;&#x5F02;&#x5E38;&#x503C;&#x548C;&#x540E;&#x7EED;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;</p>
<h3 id="11-&#x5F02;&#x5E38;&#x503C;&#x5904;&#x7406;">1.1 &#x5F02;&#x5E38;&#x503C;&#x5904;&#x7406;</h3>
<p>&#x6570;&#x636E;&#x5339;&#x914D;/&#x975E;&#x6CD5;&#x5B57;&#x7B26;&#xFF1A;&#x68C0;&#x67E5;&#x6570;&#x636E;&#x8868;&#x548C;&#x76EE;&#x6807;&#x53D8;&#x91CF;&#x7684;&#x683C;&#x5F0F;&#x662F;&#x5426;&#x5339;&#x914D;&#x3002;&#x53D1;&#x73B0;&#x4E0D;&#x5339;&#x914D;&#x5219;&#x5224;&#x65AD;&#x5176;&#x662F;&#x5426;&#x4E3A;&#x6709;&#x6548;&#x6570;&#x636E;&#xFF08;&#x201C;1&#x201D;&#x800C;&#x4E0D;&#x662F;&#x201C; &#x201D;&#xFF0C;&#x201C;&amp;&#x2026;*&#x201D;&#x7B49;&#x975E;&#x6CD5;&#x5B57;&#x7B26;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x6709;&#x6548;&#x6570;&#x636E;&#x5219;&#x8FDB;&#x884C;&#x683C;&#x5F0F;&#x8F6C;&#x6362;&#xFF0C;&#x5426;&#x5219;&#x5254;&#x9664;&#x3002;&#x8FD8;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4E00;&#x4E9B;&#x201D;&#x975E;&#x6CD5;&#x7A7A;&#x503C;&#x201C;&#xFF0C;&#x6BD4;&#x5982;&#x7A7A;&#x683C;&#xFF0C;&#x8981;&#x7528;python&#x4E2D;&#x7684;nan&#x66FF;&#x6362;&#x3002;</p>
<ul>
<li>&#x65E0;&#x7A77;&#x503C;&#xFF1A;&#x901A;&#x5E38;&#x8868;&#x73B0;&#x4E3A;inf,-inf,&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x5F88;&#x5927;&#x7684;&#x503C;&#xFF0C;&#x6BD4;&#x5982;1e20&#x8FD9;&#x6837;&#x7684;&#xFF08;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x6E90;&#x7ED9;&#x7684;&#x6781;&#x5927;&#x503C;&#x4E0D;&#x540C;&#xFF09;&#xFF0C;&#x53EF;&#x5148;&#x66FF;&#x6362;&#x6210;&#x7A7A;&#x503C;&#x518D;&#x8FDB;&#x4E00;&#x6B65;&#x5904;&#x7406;&#x3002;</li>
<li>&#x4E0D;&#x5408;&#x7406;&#x503C;&#xFF1A;&#x8FD9;&#x4E2A;&#x9700;&#x8981;&#x968F;&#x7740;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7D2F;&#x8BA1;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x7279;&#x5F81;&#x52A0;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x56E0;&#x5B50;&#x98CE;&#x63A7;&#x9884;&#x8B66;&#x7684;&#x6A21;&#x5757;&#x3002;&#x6BD4;&#x5982;&#x4EF7;&#x683C;&#x4E0D;&#x53EF;&#x80FD;&#x662F;&#x8D1F;&#x6570;&#x7B49;</li>
</ul>
<h3 id="12--&#x7F3A;&#x5931;&#x503C;&#x5904;&#x7406;">1.2  &#x7F3A;&#x5931;&#x503C;&#x5904;&#x7406;</h3>
<ul>
<li>&#x6570;&#x636E;&#x586B;&#x5145;&#xFF1A;&#x9996;&#x5148;&#x786E;&#x5B9A;&#x586B;&#x5145;&#x7B56;&#x7565;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x56E0;&#x5B50;&#x9002;&#x5408;&#x4E0D;&#x540C;&#x7684;&#x586B;&#x5145;&#x65B9;&#x6CD5;&#xFF0C;&#x524D;&#x503C;&#xFF0C;&#x6EDA;&#x52A8;&#x5747;&#x503C;&#xFF0C;KNN&#x7B49;&#x3002;&#xFF08;sklearn Imputer&#xFF09;
&#xFF08;&#x5143;&#x7D20;&#x7684;&#x586B;&#x5145;&#x51FD;&#x6570;&#xFF0C;Data_filling_f,&#x2026;..&#xFF0C;&#x53C2;&#x6570;&#xFF1A;&#x586B;&#x5145;&#x65B9;&#x6CD5;&#xFF09;</li>
<li>&#x7F3A;&#x5931;&#x503C;&#x8FC7;&#x591A;&#x5217;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x5217;&#x4E2D;&#x7684;&#x7A7A;&#x503C;&#x5360;&#x4E86;&#x603B;&#x884C;&#x6570;&#x7684;&#x4E00;&#x5B9A;&#x9608;&#x503C;&#xFF08;&#x5982;80%&#xFF09;&#xFF0C;&#x5219;&#x8BE5;&#x7279;&#x5F81;&#x56E0;&#x5B50;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7684;&#x4FE1;&#x606F;&#x8FC7;&#x5C11;&#xFF0C;&#x76F4;&#x63A5;&#x5220;&#x53BB;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x7A7A;&#x503C;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#xFF0C;&#x5219;&#x4E8C;&#x503C;&#x5316;&#x5904;&#x7406;&#x3002;
&#xFF08;&#x5148;&#x5224;&#x65AD;&#x7F3A;&#x5931;&#x503C;&#x662F;&#x5426;&#x8FC7;&#x591A;&#xFF0C;<em>missing_value</em>&#xFF0C;&#x53C2;&#x6570;&#xFF1A;&#x7279;&#x5F81;&#x540D;&#x79F0;&#x3001;&#x7A7A;&#x503C;&#x9608;&#x503C;&#x3002;
&#x5148;&#x5224;&#x65AD;&#x6709;&#x6CA1;&#x6709;&#x8D85;&#x8FC7;&#x9608;&#x503C;&#xFF0C;&#x6CA1;&#x6709;&#x5C31;&#x8FDB;&#x5165;&#x586B;&#x5145;&#xFF1B;&#x8D85;&#x8FC7;&#x9608;&#x503C;&#xFF0C;&#x5224;&#x65AD;&#x7279;&#x5F81;&#x540D;&#x79F0;&#x662F;&#x5426;&#x5728;config&#x7684;df&#x91CC;&#xFF0C;&#x662F;&#x5C31;&#x6309;&#x7167;&#x4E8C;&#x503C;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x5426;&#x5C31;&#x5220;&#x9664;&#xFF09;
Config&#xFF1A;&#x4E00;&#x5217;&#x4E3A;&#x7A7A;&#x503C;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#x7684;&#x7279;&#x5F81;&#x540D;&#x79F0;&#xFF0C;&#x4E00;&#x5217;&#x4E3A;&#x4E8C;&#x503C;&#x5316;&#x5904;&#x7406;&#x7684;&#x9608;&#x503C;&#xFF0C;&#x4E8C;&#x5217;&#x4E3A;&#x4E8C;&#x503C;&#x5316;&#x5904;&#x7406;&#x7684;&#x4E8C;&#x503C;&#xFF08;&#x4E0A;&#x4E0B;&#xFF09;&#xFF08;&#x5143;&#x7D20;&#x7684;&#x4E8C;&#x503C;&#x5316;&#x51FD;&#x6570;&#xFF1A;binarization&#xFF0C;&#x53C2;&#x6570;&#xFF1A;&#x4E8C;&#x503C;&#x5316;&#x9608;&#x503C;&#xFF0C;&#x9608;&#x503C;&#x4E0A;&#x503C;&#xFF0C;&#x9608;&#x503C;&#x4E0B;&#x503C;&#xFF09;</li>
</ul>
<h3 id="13-&#x6570;&#x636E;&#x9057;&#x6F0F;">1.3 &#x6570;&#x636E;&#x9057;&#x6F0F;</h3>
<ul>
<li>&#x65F6;&#x95F4;&#x6233;&#x4E0D;&#x5339;&#x914D;&#xFF1A;&#x6709;&#x65F6;&#x4F1A;&#x76F4;&#x63A5;&#x9519;&#x8FC7;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5BFC;&#x81F4;&#x4E00;&#x6574;&#x884C;&#x6570;&#x636E;&#x9057;&#x6F0F;&#xFF0C;&#x4E14;&#x4E0D;&#x4EE5;&#x7A7A;&#x503C;&#x7684;&#x5F62;&#x5F0F;&#x51FA;&#x73B0;&#x3002;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5BF9;&#x6BCF;&#x4E2A;&#x9891;&#x7387;/&#x4EA4;&#x6613;&#x6807;&#x7684;&#x90FD;&#x80FD;&#x591F;&#x6709;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x65F6;&#x95F4;&#x6807;&#x51C6;&#xFF0C;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x548C;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x5339;&#x914D;&#xFF0C;&#x82E5;&#x6709;&#x9057;&#x6F0F;&#x5219;&#x51FA;&#x53D1;&#x9884;&#x8B66;&#xFF0C;&#x4E0E;&#x4EA4;&#x6613;&#x65F6;&#x95F4;&#x6807;&#x51C6;merge&#x540E;&#x518D;&#x8003;&#x8651;&#x586B;&#x5145;&#x3002;
&#xFF08;&#x5F97;&#x5230;&#x6240;&#x6709;&#x7684;&#x65E5;&#x671F;&#x5E8F;&#x5217;&#x6216;df1&#xFF0C;&#x5728;&#x4EA4;&#x6613;&#x65E5;&#x671F;&#x8868;&#x4E2D;&#x627E;&#x5230;&#x6700;&#x65E9;&#x548C;&#x6700;&#x65B0;&#x7684;&#x65E5;&#x671F;&#xFF0C;&#x5F97;&#x5230;df2&#xFF0C;&#x5148;&#x5224;&#x65AD;&#x957F;&#x5EA6;&#x662F;&#x5426;&#x4E00;&#x81F4;&#xFF0C;&#x4E00;&#x81F4;&#x5C31;&#x8FDB;&#x5165;(2)&#xFF1B;&#x4E0D;&#x4E00;&#x81F4;&#x8FDB;&#x884C;&#xFF09;</li>
</ul>
<h2 id="2-&#x7279;&#x5F81;&#x6784;&#x9020;">2. &#x7279;&#x5F81;&#x6784;&#x9020;</h2>
<p>&#x7279;&#x5F81;&#x6784;&#x9020;&#x4E3B;&#x8981;&#x662F;&#x4EA7;&#x751F;&#x884D;&#x751F;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x8C13;&#x884D;&#x751F;&#x53D8;&#x91CF;&#x662F;&#x6307;&#x5BF9;&#x539F;&#x59CB;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x52A0;&#x5DE5;&#x3001;&#x7279;&#x5F81;&#x7EC4;&#x5408;&#xFF0C;&#x751F;&#x6210;&#x6709;&#x5177;&#x6709;&#x542B;&#x4E49;&#x7684;&#x65B0;&#x53D8;&#x91CF;(&#x65B0;&#x7279;&#x5F81;)
&#x6784;&#x9020;&#x539F;&#x5219;&#xFF1A;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x5BF9;&#x76EE;&#x6807;&#x662F;&#x5426;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#xFF1F;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x7279;&#x5F81;&#x7684;&#x91CD;&#x8981;&#x6027;&#x5982;&#x4F55;&#xFF1F;&#x8FD9;&#x4E2A;&#x65B0;&#x6784;&#x9020;&#x7684;&#x7279;&#x5F81;&#x4FE1;&#x606F;&#x662F;&#x5426;&#x5728;&#x5176;&#x4ED6;&#x7279;&#x5F81;&#x4F53;&#x73B0;&#x8FC7;&#xFF1F;</p>
<h3 id="21-&#x7279;&#x5F81;&#x53D8;&#x6362;">2.1 &#x7279;&#x5F81;&#x53D8;&#x6362;</h3>
<ul>
<li>&#x8FDE;&#x7EED;&#x6570;&#x636E;&#x79BB;&#x6563;&#x5316;&#xFF1A;&#x4E8C;&#x503C;&#x5316;&#x3001;&#x5206;&#x7BB1;&#x7B49;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x7279;&#x5F81;&#x503C;&#x7684;&#x8303;&#x56F4;&#x6BD4;&#x7279;&#x5F81;&#x503C;&#x672C;&#x66F4;&#x91CD;&#x8981;&#xFF0C;&#x6BD4;&#x5982;&#x67D0;&#x4E2A;&#x7279;&#x5F81;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x9608;&#x503C;&#x7684;&#x65F6;&#x5019;&#x5F88;&#x8981;&#x3002;</li>
<li>&#x79BB;&#x6563;&#x6570;&#x636E;&#x7F16;&#x7801;&#x5316;&#xFF1A;&#x5E8F;&#x53F7;&#x7F16;&#x7801;&#xFF0C;one-hot&#x7F16;&#x7801;&#xFF0C;&#x6BD4;&#x5982;&#x6240;&#x5728;&#x884C;&#x4E1A;&#x677F;&#x5757;&#x8FD9;&#x6837;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x505A;&#x7F16;&#x7801;&#x3002;</li>
<li>&#x7279;&#x5F81;&#x8F6C;&#x6362;&#xFF1A;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x6807;&#x51C6;&#x5316;&#xFF0C;cox-box&#x6B63;&#x6001;&#x5EA6;&#x5316;&#xFF0C;&#x4EE5;&#x5E2E;&#x52A9;&#x6A21;&#x578B;&#x66F4;&#x5FEB;&#x7684;&#x8BAD;&#x7EC3;&#xFF0C;&#x5BF9;&#x8FC7;&#x504F;&#x7684;&#x70B9;&#x8FDB;&#x884C;&#x7EA0;&#x6B63;&#x3002;</li>
</ul>
<h3 id="22-&#x7279;&#x5F81;&#x884D;&#x751F;">2.2 &#x7279;&#x5F81;&#x884D;&#x751F;</h3>
<ul>
<li>&#x7EDF;&#x8BA1;&#x503C;&#x6784;&#x9020;&#x6CD5;&#xFF1A;&#x901A;&#x8FC7;&#x7EDF;&#x8BA1;&#x5355;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x7EDF;&#x8BA1;&#x503C;(max,min,count,mean)&#x7B49;&#x800C;&#x5F62;&#x6210;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x3002;&#x6BD4;&#x5982;&#x65E5;&#x5185;&#x9AD8;&#x9891;&#x6570;&#x636E;&#x7684;&#x7EDF;&#x8BA1;&#x91CF;&#x4E5F;&#x53EF;&#x4EE5;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x65E5;&#x9891;&#x7279;&#x5F81;&#x3002;</li>
<li>&#x51FD;&#x6570;&#x6784;&#x9020;&#x6CD5;&#xFF1A;&#x5E73;&#x65B9;(&#x5C0F;&#x6570;&#x503C;&#x2014;&gt;&#x5927;&#x6570;&#x503C;)&#x3001;&#x5F00;&#x5E73;&#x65B9;(&#x5927;&#x6570;&#x503C;&#x2014;&gt;&#x5C0F;&#x6570;&#x503C;)&#x3001;&#x6307;&#x6570;&#x3001;&#x5BF9;&#x6570;&#x3001;&#x5DEE;&#x5206;</li>
</ul>
<h3 id="23-&#x7279;&#x5F81;&#x4EA4;&#x53C9;">2.3 &#x7279;&#x5F81;&#x4EA4;&#x53C9;</h3>
<ul>
<li>&#x6761;&#x4EF6;&#x5F0F;&#x6784;&#x9020;&#xFF1A;&#x7279;&#x5F81;A&#x5728;&#x7279;&#x5F81;B&#x4E0D;&#x540C;&#x53D6;&#x503C;&#x6761;&#x4EF6;&#x4E0B;&#x7684;&#x7EDF;&#x8BA1;&#x91CF;&#x3002;</li>
<li>&#x7B1B;&#x5361;&#x5C14;&#x79EF;&#xFF1A;&#x76F4;&#x63A5;&#x5BF9;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#xFF0C;&#x7EC4;&#x5408;&#x7279;&#x5F81;&#x76F4;&#x63A5;&#x6210;&#x4E3A;&#x65B0;&#x7684;&#x7279;&#x5F81;&#xFF08;&#x8FDE;&#x7EED;&#x7279;&#x5F81;&#x9700;&#x5206;&#x7BB1;&#xFF09;&#x3002;</li>
<li>GP-Learn&#xFF1A;&#x9057;&#x4F20;&#x7B97;&#x6CD5;&#xFF0C;&#x968F;&#x673A;&#x7EC4;&#x5408;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x7B5B;&#x9009;&#x3002;</li>
</ul>
<h2 id="3-&#x7279;&#x5F81;&#x7B5B;&#x9009;">3. &#x7279;&#x5F81;&#x7B5B;&#x9009;</h2>
<p>&#x5F53;&#x6570;&#x636E;&#x5904;&#x7406;&#x597D;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9009;&#x62E9;&#x6709;&#x610F;&#x4E49;&#x7684;&#x7279;&#x5F81;&#x8F93;&#x5165;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x540C;&#x65F6;&#x907F;&#x514D;&#x8FC7;&#x591A;&#x7279;&#x5F81;&#x9020;&#x6210;&#x7684;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x4E0E;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x6D88;&#x8017;</p>
<h3 id="31-&#x7279;&#x5F81;&#x9009;&#x62E9;">3.1 &#x7279;&#x5F81;&#x9009;&#x62E9;</h3>
<ul>
<li>&#x8FC7;&#x6EE4;&#x6CD5;&#xFF1A;&#x8FC7;&#x6EE4;&#x6CD5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x7EDF;&#x8BA1;&#x91CF;&#x6216;&#x5047;&#x8BBE;&#x68C0;&#x9A8C;&#x7ED3;&#x679C;&#x4E3A;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x6253;&#x5206;&#x3002;&#x5F97;&#x5206;&#x8F83;&#x9AD8;&#x7684;&#x529F;&#x80FD;&#x5F80;&#x5F80;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x6B64;&#x5E94;&#x88AB;&#x5305;&#x542B;&#x5728;&#x5B50;&#x96C6;&#x4E2D;&#xFF0C;&#x5982;&#x91C7;&#x7528;&#x65B9;&#x5DEE;&#xFF0C;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#xFF0C;&#x4E92;&#x4FE1;&#x606F;&#x7B49;&#x3002;</li>
<li>&#x5D4C;&#x5165;&#x6CD5;&#xFF1A;&#x5148;&#x4F7F;&#x7528;&#x67D0;&#x4E9B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x7B97;&#x6CD5;&#x548C;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x5F97;&#x5230;&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x6743;&#x503C;&#x7CFB;&#x6570;&#x6216;&#x8005;&#x7279;&#x5F81;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x4ECE;&#x5927;&#x5230;&#x5C0F;&#x9009;&#x62E9;&#x7279;&#x5F81;&#x3002;</li>
<li>&#x5305;&#x88F9;&#x6CD5;&#xFF1A;&#x5C01;&#x88C5;&#x65B9;&#x6CD5;&#x5C06;&#x7279;&#x5F81;&#x9009;&#x62E9;&#x95EE;&#x9898;&#x89C6;&#x4F5C;&#x641C;&#x7D22;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x5176;&#x76EE;&#x6807;&#x4E3A;&#x4ECE;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x96C6;&#x5408;&#x4E2D;&#x641C;&#x7D22;&#x51FA;&#x4E00;&#x4E2A;&#x6700;&#x4F73;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x5B50;&#x96C6;&#x5728;&#x6A21;&#x578B;&#x4E2D;&#x8868;&#x73B0;&#x6700;&#x4F73;&#x3002;
&#x5728;&#x6BCF;&#x4E00;&#x6B65;&#x4E2D;&#xFF0C;&#x5176;&#x5728;&#x7279;&#x5F81;&#x5B50;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#xFF0C;&#x5E76;&#x5728;&#x4E0B;&#x4E00;&#x6B65;&#x7EE7;&#x7EED;&#x8C03;&#x6574;&#x7279;&#x5F81;&#x5B50;&#x96C6;,&#x91CD;&#x65B0;&#x8BAD;&#x7EC3;&#x8BC4;&#x4F30;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x6700;&#x4F73;&#x5B50;&#x96C6;&#x6216;&#x8FBE;&#x5230;&#x6700;&#x5927;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x4E3A;&#x6B62;</li>
</ul>
<h3 id="32-&#x964D;&#x7EF4;">3.2 &#x964D;&#x7EF4;</h3>
<ul>
<li>&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;PCA&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x91CD;&#x6784;&#x8BEF;&#x5DEE;</li>
<li>&#x7EBF;&#x6027;&#x5224;&#x522B;&#x5206;&#x6790;LDA&#xFF0C;&#x6700;&#x5927;&#x5316;&#x7C7B;&#x522B;&#x53EF;&#x5206;&#x6027;</li>
<li>&#x5224;&#x522B;&#x8BAD;&#x7EC3;discriminative training&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;</li>
<li>&#x7ACB;&#x6210;&#x5206;&#x5206;&#x6790;ICA&#xFF0C;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x7684;&#x4F7F;&#x5404;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x72EC;&#x7ACB;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Factors_Construction.html" class="navigation navigation-prev " aria-label="Previous page: 因子构建">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Quantitative_Strategy.html" class="navigation navigation-next " aria-label="Next page: 量化策略">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"特征工程","level":"1.4","depth":1,"next":{"title":"量化策略","level":"1.5","depth":1,"path":"Quantitative_Strategy.md","ref":"Quantitative_Strategy.md","articles":[]},"previous":{"title":"因子构建","level":"1.3","depth":1,"path":"Factors_Construction.md","ref":"Factors_Construction.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Feature_Engineering.md","mtime":"2022-04-13T08:52:00.669Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-04-13T09:21:48.997Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

